# Course Description

The R data.table package is rapidly making its name as the number one choice for handling large datasets in R. This online data.table tutorial will bring you from data.table novice to expert in no time. Once you are introduced to the general form of a data.table query, you will learn the techniques to subset your data.table, how to update by reference and how you can use data.table’s set()-family in your workflow. The course finishes with more complex concepts such as indexing, keys and fast ordered joins. Upon completion of the course, you will be able to use data.table in R for a more efficient manipulation and analysis process. Enjoy!

In [1]:
library(data.table)

# 1. Data.table novice

Introduction on what exactly a data.table is, how it differs from the traditional data.frame in R, and understanding the general form of a data.table query.

## Section 1 - Introduction - Video

### Create and subset a data.table
Welcome to the interactive exercises for your data.table course. Here you will learn the ins and outs of working with the data.table package.

While most of the material is covered by Matt and Arun in the videos, you will sometimes need to show some street smarts to get to the right answer. Remember that before using the hint you can always have a look at the official documentation by typing ?data.table in the console.

Let's start with some warm-up exercises based on the topics covered in the video. Recall from the video that you can use L after a numeric to specify that it is an integer. You can also give columns with different lengths when creating a data.table, and R will "recycle" the shorter column to match the length of the longer one by re-using the first items. In the example below, column x is recycled to match the length of column y:

`data.table(x = c("A", "B"), y = 1:4)
   x y
1: A 1
2: B 2
3: A 3
4: B 4`

You can also review the slides used in the videos by pressing the slides button.

INSTRUCTIONS
100 XP

 - Create a data.table my_first_data_table with a column x = c("a", "b", "c", "d", "e") and a column y = c(1, 2, 3, 4, 5). Use the function data.table().
 - Create a two-column data.table DT that contains the four integers 1, 2, 1 and 2 in the first column a and the letters A, B, C and D in the second column b. Use recycling so that the contents of a will be automatically used twice. Note that LETTERS[1] returns "A", LETTERS[2] returns "B", and so on.
 - Select the third row of DT and just print the result to the console.
 - Select the second and third rows without using commas and print the result to the console.

In [3]:
# The data.table package is preloaded

# Create my_first_data_table
my_first_data_table <- data.table(x = c("a", "b", "c", "d", "e"), 
                                  y = c(1, 2, 3, 4, 5))  
  
# Create a data.table using recycling
DT <- data.table(a = c(1L, 2L), b = LETTERS[1:4])

# Print the third row to the console
print(DT[3,])

# Print the second and third row to the console without using commas
print(DT[2:3,])

   a b
1: 1 C
   a b
1: 2 B
2: 1 C

### Getting to know a data.table
You can pass a data.table to base R functions like `head()` and `tail()` that accept a data.frame because data.tables are also data.frames. Also, keep in mind that the special symbol .N, when used inside square brackets, contains the number of rows. For example, `DT[.N]` and `DT[nrow(DT)]` will both return the last row in DT.

INSTRUCTIONS

100 XP
 - Select the second to last row of the table using .N.
 - Return the column names() of the data.table.
 - Return the number of rows and number of columns of the data.table using the dim() function.
 - Select row 2 twice and row 3 once, returning a data.table with three rows (two of which are identical).

In [4]:
# DT and the data.table package are pre-loaded

# Print the second to last row of DT using .N
print(DT[.N-1])

# Print the column names of DT
names(DT)

# Print the number or rows and columns of DT
dim(DT)

# Print a new data.table containing rows 2, 2, and 3 of DT
DT[c(2,2,3),]

   a b
1: 1 C

[1] "a" "b"

[1] 4 2

  a b
1 2 B
2 2 B
3 1 C

## Section 2 - Selecting columns in j - Video

### A data.table of a vector?
A data.table DT is preloaded in your workspace on the right. Type DT in the console to have a look at it. As you have learned in the video, you can select a column from that data.table with DT[, .(B)].

What do you think is the output of DT[, B]?

INSTRUCTIONS
50 XP
Possible Answers
 - A data.table
 - press 1
 - A vector (Correct)
 - press 2

In [9]:
DT = data.table(A=1:5, B=letters[1:5], C = 6:10)
DT

  A B C
1 1 a  6
2 2 b  7
3 3 c  8
4 4 d  9
5 5 e 10

In [10]:
DT[, .(B)]

  B
1 a
2 b
3 c
4 d
5 e

In [11]:
DT[, B]

[1] "a" "b" "c" "d" "e"

Correct. When you use .() in j, the result is always a data.table. For convenience, data.table also provides the option to return a vector while computing on just a single column and not wrapping it with .().

### A non-existing column
Have a close look at 1.1 and 1.2 from the data.table package FAQs.

Type D <- 5 in the console. What do you think is the output of DT[, .(D)] and DT[, D]?

INSTRUCTIONS
50 XP
Possible Answers
Both outputs give an error.
 - press 1
 - DT[, D] returns 5 as vector, and DT[, .(D)] returns 5 as data.table. (Correct)
 - press 2
 - DT[, D] returns 5 as data.table, and DT[, .(D)] returns 5 as vector.
 - press 3
 - DT[, D] returns 5 as vector, and DT[, .(D)] returns an error.
 - press 4
 - DT[, D] returns an error, and DT[, .(D)] returns 5 as data.table. 
 - press 5

Well done! Column D does not exist in DT and is thus not seen as a variable. This causes data.table to look for D in DT's parent frame. Also note that .() in j always returns a data.table.

### Subsetting data.tables
As a reminder, `DT[i, j, by]` is pronounced

Take DT, subset rows using i, then calculate j grouped by by.

In the video, the second argument j was covered. j can be used to select columns by wrapping the column names in .().

In addition to selecting columns, you can also call functions on them as if the columns were variables. For example, if you had a data.table heights storing people's heights in inches, you could compute their heights in feet as follows:

`    name  eye_color   height_inch
1:   Tom      Brown            69
2: Boris       Blue            71
3:   Jim       Blue            68`

`> heights[, .(name, 
              height_ft = height_inch / 12)]
    name   height_ft
1:   Tom    5.750000
2: Boris    5.916667
3:   Jim    5.666667`

INSTRUCTIONS
100 XP

 - Create a subset containing the columns B and C for rows 1 and 3 of DT. Simply print out this subset to the console.
 - From DT, create a data.table, ans with two columns: B and val, where val is the product of A and C.
 - Fill in the blanks in the assignment of ans2, such that it equals the data.table specified in target. Use columns from the previously defined data.tables to produce the val column.

In [12]:
# DT and the data.table package are pre-loaded

# Subset rows 1 and 3, and columns B and C
DT[c(1,3), .(B,C)]

# Assign to ans the correct value
ans = DT[,.(B, val=A*C)]
  
# Fill in the blanks such that ans2 equals target
target <- data.table(B = c("a", "b", "c", "d", "e", 
                           "a", "b", "c", "d", "e"), 
                     val = as.integer(c(6:10, 1:5)))
ans2 <- DT[, .(B, val = as.integer(c(6:10, 1:5)))]

  B C
1 a 6
2 c 8

Great job! Did you notice B is recycled?

### Section 3 - Doing j by group - Video

### The by basics
In this section you were introduced to the last of the main parts of the data.table syntax: by. If you supply a j expression and a by list of expressions, the j expression is repeated for each by group. Time to master the by argument with some hands-on examples and exercises.

First, just print iris to the console and observe that all rows are printed and that the column names scroll off the top of your screen. This is because iris is a data.frame. Scroll back up to the top to see the column names.

INSTRUCTIONS
100 XP

 - Convert the iris dataset to a data.table DT. You're now ready to use data.table magic on it!
 - Create a new column containing the mean Sepal.Length for each Species. Do not provide a name for this newly created column.
 - Do exactly the same as in the instruction above, but this time, group by the first letter of the Species name instead. Use substr() for this.

In [13]:
# iris is already available in your workspace

# Convert iris to a data.table: DT
DT =data.table(iris)

# For each Species, print the mean Sepal.Length
DT[,mean(Sepal.Length), by=Species]
#DT[,.(mean= mean(Sepal.Length)), by=Species]

# Print mean Sepal.Length, grouping by first letter of Species
DT[,mean(Sepal.Length), by=.(substr(Species,1,1))]

  Species    V1
1 setosa     5.006
2 versicolor 5.936
3 virginica  6.588

  substr V1
1 s      5.006
2 v      6.262

### Using .N and by
You saw earlier that .N can be used in i and that it designates the number of rows in DT. There, it is typically used for returning the last row or an offset from it. .N can be used in j too and designates the number of rows in this group. This becomes very powerful when you use it in combination with by.

DT, a data.table version of iris, is already loaded in your workspace, so you can start experimenting right away. In this exercise, you will group by sepal area. Though sepals aren't rectangles, just multiply the length by the width to calculate the area.

INSTRUCTIONS
100 XP
 - Group the specimens by Sepal area (Sepal.Length * Sepal.Width) to the nearest 10 cm2. Count how many occur in each group by specifying .N in j. Simply print the resulting data.table. Use the template in the sample code by filling in the blanks.
 - Copy and adapt the solution to the above question, to name the columns Area and Count, respectively.

In [14]:
# data.table version of iris: DT
DT <- as.data.table(iris)

# Group the specimens by Sepal area (to the nearest 10 cm2) and count how many occur in each group
DT[, .N, by = 10 * round(Sepal.Length * Sepal.Width / 10)]

# Now name the output columns `Area` and `Count`
DT[, .(Count=.N), by = .(Area=10 * round(Sepal.Length * Sepal.Width / 10))]

  round N
1 20    117
2 10     29
3 30      4

  Area Count
1 20   117
2 10    29
3 30     4

Correct! Notice that the order of the groups is retained, just like when they first appeared in DT. This exercise was not that simple, so it's good to see you've made it!

## Return multiple numbers in j
In the previous exercises, you've returned only single numbers in j. However, this is not necessary. You'll experiment with this via a new data.table DT, which has already been specified in the sample code.

INSTRUCTIONS
100 XP
 - Create a new data.table DT2 with 3 columns, A, B and C, where C is the cumulative sum of the C column of DT. Call the `cumsum()` function in the j argument, and group by `.(A, B)` (i.e. both columns A and B).
 - Select from DT2 the last two values of C using the `tail()` function, and assign that to column C while you group by A alone. Make sure the column names don't change.

INCORRECT SUBMISSION

Check your code for the second instruction. Use `tail(C, 2)` to specify the C column in the j part. Simply group by A.

In [16]:
# Create the data.table DT
DT <- data.table(A = rep(letters[2:1], each = 4L), 
                 B = rep(1:4, each = 2L), 
                 C = sample(8))

# Create the new data.table, DT2
DT2 = DT[, .(C=cumsum(C)), by=.(A,B)]

# Select from DT2 the last two values from C while you group by A
DT2[,.(C=tail(C,2)), by=A]

  A C
1 b  4
2 b  5
3 a  7
4 a 10

Good job! Time to do some chaining…

You have finished the chapter "Data.table novice"!

# 2. Data.table yeoman

Learn how to do multiple operations on the same data.table in one single statement, how to easily take a subset of your data, update by reference, and work with the data.table set()-family.

## Section 4 - Chaining

### Chaining, the basics
Now that you are comfortable with data.table's DT[i, j, by] syntax, it is time to practice some other very useful concepts in data.table. Here, we'll have a more detailed look at chaining.

Chaining allows the concatenation of multiple operations in a single expression. It's easy to read because the operations are carried out from left to right. Furthermore, it helps to avoid the creation of unnecessary temporary variables (which could quickly clutter one's workspace).

INSTRUCTIONS
100 XP
 - In the previous section, you calculated DT2 by taking the cumulative sum of C while grouping by A and B. Next, you selected the last two values of C from DT2 while grouping by A alone. This code is included in the sample code. Use chaining to restructure the code. Simply print out the result of chaining.

In [2]:
# The data.table package has already been loaded

# Build DT
DT <- data.table(A = rep(letters[2:1], each = 4L), 
                 B = rep(1:4, each = 2L), 
                 C = sample(8)) 

# Combine the two steps in a one-liner
#DT2 <- DT[, .(C = cumsum(C)), by = .(A, B)]
#DT2[, .(C = tail(C, 2)), by = A]
DT[, .(C = cumsum(C)), by = .(A, B)][, .(C = tail(C, 2)), by = A]

  A C
1 b  4
2 b 11
3 a  8
4 a 13

Great! Note that chaining can significantly reduce the amount of instructions necessary in your code.

### Chaining your iris dataset
In the previous chapter, you converted the iris dataset to a data.table DT. This DT is already available in your workspace. Print DT to the console to remind yourself of its contents. Now, let's see how you can use chaining to simplify manipulations and calculations.

INSTRUCTIONS
100 XP
 - Get the median of each of the four columns Sepal.Length, Sepal.Width, Petal.Length and Petal.Width, while grouping by Species. Reuse the same column names (e.g. the column containing the median Sepal.Length is still called Sepal.Length). Next, order() Species in descending order using chaining. This is deliberately repetitive, but we have a solution for you in the next exercise!

In [5]:
DT = as.data.table(iris)

In [6]:
# The data.table DT is loaded in your workspace

# Perform chained operations on DT
DT[, .(Sepal.Length = median(Sepal.Length), 
       Sepal.Width = median(Sepal.Width), 
       Petal.Length = median(Petal.Length),
       Petal.Width = median(Petal.Width)), 
   by = Species][order(Species, decreasing=TRUE)]

#Also,   
#DT[,lapply(.SD,median), by=Species]

  Species    Sepal.Length Sepal.Width Petal.Length Petal.Width
1 virginica  6.5          3.0         5.55         2.0
2 versicolor 5.9          2.8         4.35         1.3
3 setosa     5.0          3.4         1.50         0.2

Nicely done, but this is a little bit repetitive and an error can easily be made if you aren't careful. Maybe there is a better way to do this kind of analysis? Let's find out…

## Section 5 - Subset of Data - Video

Programming time vs readability
It is a good idea to make use of familiar functions from base R to reduce programming time without losing readability.

The data.table package provides a special built-in variable .SD. It refers to the subset of data for each unique value of the by argument. That is, the number of observations in the output will be equal to the number of unique values in by.

Recall that the by argument allows us to separate a data.table into groups. We can now use the .SD variable to reference each group and apply functions separately. For example, suppose we had a data.table storing information about dogs:

`Sex	Weight	Age	Height
M	40	1	12
F	30	4	7
F	80	12	9
M	90	3	14
M	40	6	12`
We could then use

dogs[, lapply(.SD, mean), by = Sex]
to produce average weights, ages, and heights for male and female dogs separately:

`   Sex   Weight      Age   Height
1:   M 56.66667 3.333333 12.66667
2:   F 55.00000 8.000000  8.00000`
A data.table DT has been created for you and is available in the workspace. Type DT in the console to print it out and inspect it.

INSTRUCTIONS
100 XP
 - Get the mean of columns y and z grouped by x by using .SD.
 - Get the median of columns y and z grouped by x by using .SD.

In [8]:
DT = data.table(x = c(2, 1, 2, 1, 2, 2, 1), y = c(1, 3, 5, 7, 
9, 11, 13), z = c(2, 4, 6, 8, 10, 12, 14))

In [9]:
# A new data.table DT is available

# Mean of columns
DT[,lapply(.SD,mean), by=x]

# Median of columns
DT[,lapply(.SD, median), by=x]


#DT = data.table(x = c(2, 1, 2, 1, 2, 2, 1), 
#y = c(1, 3, 5, 7, 9, 11, 13), 
#z = c(2, 4, 6, 8, 10, 12, 14))

  x y        z
1 2 6.500000 7.500000
2 1 7.666667 8.666667

  x y z
1 2 7 8
2 1 7 8

Well done! Let's have a look at .SDcols now.

### Introducing .SDcols
.SDcols specifies the columns of DT that are included in .SD. Using .SDcols comes in handy if you have too many columns and you want to perform a particular operation on a subset of the columns (apart from the grouping variable columns).

Using .SDcols allows you to apply a function to all rows of a data.table, but only to some of the columns. For example, consider the dog example from the last exercise. If you wanted to compute the average weight and age (the second and third columns) for all dogs, you could assign .SDcols accordingly:

`dogs[, lapply(.SD, mean), .SDcols = 2:3]`
`   Weight Age
1:     56 5.2`

While learning the data.table package, you may want to occasionally refer to the documentation. Have a look at ?data.table for more info on .SDcols.

Yet another data.table, DT, has been prepared for you in your workspace. Start by printing it to the console.

INSTRUCTIONS
70 XP

 - Calculate the sum of the columns that start with Q, using .SD and .SDcols. Set .SDcols equal to 2:4.
 - Set .SDcols to be the result of a function call. This time, calculate the sum of columns H1 and H2 using paste0() to specify the .SDcols argument.
 - Finally, select all but the first row of the groups names 6 and 8, returning only the grp column and the columns that start with Q. Use -1 in i of .SD and use paste0() again. Type desired_result into the console to see what your answer should look like.

In [11]:
DT = data.table(grp = c(6, 6, 8, 8, 8), Q1 = c(4L, 4L, 4L, 2L, 
4L), Q2 = c(4L, 2L, 2L, 2L, 2L), Q3 = c(5L, 3L, 5L, 5L, 1L), 
    H1 = c(2L, 3L, 5L, 3L, 2L), H2 = c(4L, 5L, 4L, 2L, 2L))

In [12]:
# A new data.table DT is available

# Calculate the sum of the Q columns
DT[, lapply(.SD,sum), .SDcols=2:4]

# Calculate the sum of columns H1 and H2 
#DT[,lapply(.SD, sum), .SDcols=5:6]
DT[,lapply(.SD, sum), .SDcols=paste0("H",1:2)]

# Select all but the first row of groups 1 and 2, returning only the grp column and the Q columns
DT[,.SD[-1], .SDcols=2:4, by=grp]

  Q1 Q2 Q3
1 18 12 19

  H1 H2
1 15 17

  grp Q1 Q2 Q3
1 6   4  2  3
2 8   2  2  5
3 8   4  2  1

#### HINT
 - For the second instruction, make sure to use .SDcols to specify the columns to be included in .SD and use lapply(.SD, sum).
 - The paste0() function pastes together two or more character vectors together with no space in between (hence, the 0 in the function name). In this exercise, the two vectors you want to pass to paste0() are "H" and 1:2, returning the strings "H1" and "H2".

### Mixing it together: lapply, .SD, .SDcols and .N
This exercise is a challenging one, so don't give up! It's important to remember that whenever the j argument is a list (e.g. if it contains .SD or a call to lapply()), a data.table is returned. For example:

dogs[, lapply(.SD, mean), by = sex, .SDcols = c("weight", "age")]
will return a data.table containing average weights and ages for dogs of each sex.

It's also helpful to know that combining a list with a vector results in a new longer list. Lastly, note that when you select .N on its own, it is renamed N in the output for convenience when chaining.

For this exercise, DT, which contains variables x, y, and z, is loaded in your workspace. You must combine lapply(), .SD, .SDcols, and .N to get your call to return a specific output. Good luck!

INSTRUCTIONS
100 XP
INSTRUCTIONS
100 XP
Get the sum of all columns x, y and z and the number of rows in each group while grouping by x. Your answer should be identical to this:

` x x  y  z N
1: 2 8 26 30 4
2: 1 3 23 26 3`
Get the cumulative sum of column x and y while grouping by x and z > 8 such that the answer looks like this:

` by1   by2 x  y
1:   2 FALSE 2  1
2:   2 FALSE 4  6
3:   1 FALSE 1  3
4:   1 FALSE 2 10
5:   2  TRUE 2  9
6:   2  TRUE 4 20
7:   1  TRUE 1 13`

In [14]:
DT = data.table(x = c(2, 1, 2, 1, 2, 2, 1), y = c(1, 3, 5, 7, 
9, 11, 13), z = c(2, 4, 6, 8, 10, 12, 14))

In [15]:
# DT is pre-loaded

# Sum of all columns and the number of rows
DT[,c(lapply(.SD,sum),.N),by=x, .SDcols=c("x","y","z")]
#DT[,c(lapply(.SD,sum),.N),by=x, .SDcols=x:z]


# Cumulative sum of column x and y while grouping by x and z > 8
DT[, lapply(.SD,cumsum), .SDcols=x:y,by=.(by1=x,by2=z>8)]

  x x y  z  N
1 2 8 26 30 4
2 1 3 23 26 3

  by1 by2   x y
1 2   FALSE 2  1
2 2   FALSE 4  6
3 1   FALSE 1  3
4 1   FALSE 2 10
5 2    TRUE 2  9
6 2    TRUE 4 20
7 1    TRUE 1 13

Wow, good job! This one was not easy at all!

In [3]:
DT = data.table(x=c(2,2,1,1,1), y=c(6,7,8,9,10), z = NA)
DT

  x y  z
1 2  6 NA
2 2  7 NA
3 1  8 NA
4 1  9 NA
5 1 10 NA

In [5]:
str(DT)

Classes 'data.table' and 'data.frame':	5 obs. of  3 variables:
 $ x: num  2 2 1 1 1
 $ y: num  6 7 8 9 10
 $ z: logi  NA NA NA NA NA
 - attr(*, ".internal.selfref")=<externalptr>

In [9]:
DT[2:4, z := sum(y), by= x]

ERROR: Error in `[.data.table`(DT, 2:4, `:=`(z, sum(y)), by = x): Type of RHS ('double') must match LHS ('logical'). To check and coerce would impact performance too much for the fastest cases. Either change the type of the target column, or coerce the RHS of := yourself (e.g. by using 1L instead of 1)

### Adding, updating and removing columns
As you now know, := is defined for use in j only, and is used to update data.tables by reference. One way of using := is the LHS := RHS form, where LHS is a character vector of columns (referenced by name or number) you wish to update and RHS is the corresponding value for each column (Note: LHS stands for "left hand side" and RHS stands for "right hand side" in what follows).

For example, the following line multiplies every row of column C by 10 and stores the result in C:

DT[, C := C * 10]
This first exercise will thoroughly test your understanding of := used in the LHS := RHS form. It's time for you to show off your knowledge! A data.table DT has been defined for you in the sample code.

INSTRUCTIONS
100 XP
 - Add a column to DT by reference, named Total, that contains sum(B) for each group in column A.
 - Add 1L to the values in column B, but only in the rows 2 and 4.
 - Add a new column Total2 that contains sum(B) grouped by A but just over rows 2, 3 and 4.
 - Remove the Total column from DT.
 - Use [[ to select the third column as a vector. Simply print it out to the console.

In [13]:
# The data.table DT
DT <- data.table(A = letters[c(1, 1, 1, 2, 2)], B = 1:5)

# Add column by reference: Total
DT[, Total := sum(B), by=A]

# Add 1 to column B
DT[c(2,4), B := B+1L]

# Add a new column Total2
DT[2:4, Total2 := sum(B), by=A]

# Remove the Total column
DT[, Total := NULL]

# Select the third column using `[[`
DT[[3]]

[1] NA  6  6  5 NA

Great job, this was not that easy. Note that for the second instruction in j the performance goes up if you coerce RHS to integer yourself via 1L or via as.integer().

### To assign or not to assign, that is the question
Print DT to the console. When using the := operator in j, do you need to assign the result to DT as follows?

DT <- DT[, Total := sum(B), by = A]
INSTRUCTIONS
50 XP
Possible Answers
Click or Press Ctrl+1 to focus
 - Yes.
 - press 1
 - No, the DT <- part is not necessary. (Correct)
 - press 2
 - No. It can make a difference sometimes, but just not in this particular case.
 - press 3

Well done! The DT <- part is not necessary because the call makes updates to the column by reference.

### Deleting a column for a subset of rows
Try deleting a column only for a subset of rows: DT[2, B := NULL]. Did this work?

INSTRUCTIONS
50 XP
Possible Answers
 - No. This gives an error stating that when deleting columns, i should not be provided. (Correct)
 - press 1
 - Yes, because the data.table package states that you can add, modify, and/or delete columns by reference by group within a subset.
 - press 2

### The functional form
You've had practice with using := in the LHS := RHS form. The second way to use := is with functional form:

`DT[, `:=`(colA = colB + colC)]`

Notice that the := is surrounded by two tick marks! Otherwise data.table will throw a syntax error. It is also important to note that in the generic functional form above, my_fun() can refer to any function, including the basic arithmetic functions. The nice thing about the functional form is that you can get both the RHS alongside the LHS so that it's easier to read.

Time for some experimentation. A data.table DT has been prepared for you in the sample code.

INSTRUCTIONS
100 XP
 - Update B with B + 1, add a new column C with A + B, and add a new column D of just 2's.
 - A variable my_cols has already been defined. Use it to delete these columns from DT.
 - Finally, delete column D using the column number (2), not its name (D).

Well done! A column is either there or it's not. It makes no sense to partially delete it. If you find yourself needing to do this, then consider using NAs instead. Rather than silently ignoring the mistaken use of i, data.table throws a syntax error straight away so you can fix it.

In [14]:
# A data.table DT has been created for you
DT <- data.table(A = c(1, 1, 1, 2, 2), B = 1:5)

# Update B, add C and D
DT[, `:=`(B=B+1, C=A+B, D=2)]

# Delete my_cols
my_cols <- c("B", "C")
DT[, (my_cols):=NULL]

# Delete column 2 by number
DT[, names(DT)[2]:=NULL]

## Section 7 - Using set() - Video

### Ready, set(), go!
The set() function is used to repeatedly update a data.table by reference. You can think of the set() function as a loopable, low overhead version of the := operator, except that set() cannot be used for grouping operations. The structure of the set() function looks like this:

set(DT, index, column, value)
The function takes four arguments:

A data.table with the columns you wish to update
The index used in a loop (e.g. the i in for(i in 1:5))
The column or columns you wish to update in the loop
How the column or columns should be updated
In the next two exercises, you will focus on using set() and its siblings setnames() and setcolorder(). You are two exercises away from becoming a data.table yeoman!

INSTRUCTIONS
70 XP

 - A data.table DT has been created for you in the workspace. Check it out!
 - Loop through columns 2, 3, and 4, and for each one, select 3 rows at random and set the value of that column to NA.
 - Change the column names to lower case using the tolower() function. When setnames() is passed a single input vector, that vector needs to contain all the new names.
 - Print the resulting DT to the console to see what changed.

In [4]:
DT = data.table(A = c(2L, 2L, 3L, 5L, 2L, 5L, 5L, 4L, 4L, 1L), 
    B = c(2L, 1L, 4L, 2L, 4L, 3L, 4L, 5L, 2L, 4L), C = c(5L, 
    2L, 4L, 1L, 2L, 2L, 1L, 2L, 5L, 2L), D = c(3L, 3L, 3L, 1L, 
    5L, 4L, 4L, 1L, 4L, 3L))

In [6]:
# Set the seed
set.seed(1)

# Check the DT that is made available to you
DT

# For loop with set
for (i in 2:4) set(DT, sample(10, 3), i, NA)

# Change the column names to lowercase
setnames(DT, c("A", "B", "C", "D"), c("a", "b", "c", "d"))

# Print the resulting DT to the console
DT

   A B C D
1  2 2 5 3
2  2 1 2 3
3  3 4 4 3
4  5 2 1 1
5  2 4 2 5
6  5 3 2 4
7  5 4 1 4
8  4 5 2 1
9  4 2 5 4
10 1 4 2 3

   a b  c  d
1  2  2  5  3
2  2  1 NA  3
3  3 NA  4  3
4  5 NA  1  1
5  2 NA  2  5
6  5  3  2 NA
7  5  4  1  4
8  4  5 NA  1
9  4  2  5 NA
10 1  4 NA NA

### The set() family
A summary of the set() family:

set() is a loopable, low overhead version of :=.
You can use setnames() to set or change column names.
setcolorder() lets you reorder the columns of a data.table.
A data.table DT has been defined for you in the sample code.

INSTRUCTIONS
100 XP
 - First, add a suffix "_2" to all column names of DT. Use paste0() here.
 - Next, use setnames() to change a_2 to A2.
 - Lastly, reverse the order of the columns with setcolorder().

In [7]:
# Define DT
DT <- data.table(a = letters[c(1, 1, 1, 2, 2)], b = 1)

# Add a suffix "_2" to all column names
setnames(DT, names(DT), paste0(names(DT), "_2"))

# Change column name "a_2" to "A2"
setnames(DT, "a_2", "A2")

# Reverse the order of the columns
setcolorder(DT, c("b_2", "A2"))

Congratulations! You are now a data.table yeoman! Ready to become a data.table expert?

## 3. Data.table expert

Discover the potential behind indexing, followed by generating and using keys. The final part focuses on fast ordered joins.

## Section 8 - Indexing - Video

### Selecting rows the data.table way
In the video, Matt showed you how to use column names in i to select certain rows. Since practice makes perfect, and since you will find yourself selecting rows over and over again, it'll be good to do a small exercise on this with the familiar iris dataset.

INSTRUCTIONS
100 XP
 - Convert the iris dataset to a data.table and store the result as iris.
 - Select all the rows where Species is "virginica".
 - Select all the rows where Species is either "virginica" or "versicolor".

In [ ]:
# The data.table package is pre-loaded

# Convert iris to a data.table
iris = data.table(iris)

# Species is "virginica"
iris[Species == "virginica"]

# Species is either "virginica" or "versicolor"
iris[Species %in% c("virginica", "versicolor"),]

Good job! Now you know how to select using column names in i (to select rows) and in j (to select columns and run functions on columns).

# 3. Data.table expert

Discover the potential behind indexing, followed by generating and using keys. The final part focuses on fast ordered joins.

## Section 8 - Indexing

### Selecting rows the data.table way
In the video, Matt showed you how to use column names in i to select certain rows. Since practice makes perfect, and since you will find yourself selecting rows over and over again, it'll be good to do a small exercise on this with the familiar iris dataset.

INSTRUCTIONS
100 XP
 - Convert the iris dataset to a data.table and store the result as iris.
 - Select all the rows where Species is "virginica".
 - Select all the rows where Species is either "virginica" or "versicolor".

In [ ]:
# The data.table package is pre-loaded

# Convert iris to a data.table
iris = data.table(iris)

# Species is "virginica"
iris[Species == "virginica"]

# Species is either "virginica" or "versicolor"
iris[Species %in% c("virginica", "versicolor"),]

Good job! Now you know how to select using column names in i (to select rows) and in j (to select columns and run functions on columns).

### Removing columns and adapting your column names
In the previous exercise, you selected certain rows from the iris data.table based on the column names. Now you have to take your understanding of the data.table package to the next level by using standard R functions and regular expressions to remove columns and change column names. To practice this, you'll do a little manipulation to prepare for the next exercise.

Since regular expressions can be tricky, here is a quick refresher:

Metacharacters allow you to match certain types of characters. For example, . means any single character, ^ means "begins with", and $ means "ends with".
If you want to use any of the metacharacters as actual text, you need to use the \\ escape sequence.
INSTRUCTIONS
100 XP

- Simplify the names of the columns in iris that contain "Sepal." by removing the "Sepal." prefix. Use gsub() along with the appropriate regular expression inside a call to setnames().
- Remove the two columns that start with "Petal" from the iris data.table.

In [4]:
# iris as a data.table
iris <- as.data.table(iris)

# Remove the "Sepal." prefix
setnames(iris, grep("^Sepal.", names(iris), value=TRUE), gsub("^Sepal.", "", grep("^Sepal.", names(iris), value=TRUE)))

# Remove the two columns starting with "Petal"
iris[,c("Petal.Length", "Petal.Width") := NULL]
 #grep("^Petal.", names(iris), value=TRUE)

Warning message in `[.data.table`(iris, , `:=`(c("Petal.Length", "Petal.Width"), :
"Adding new column 'Petal.Length' then assigning NULL (deleting it)."Warning message in `[.data.table`(iris, , `:=`(c("Petal.Length", "Petal.Width"), :
"Adding new column 'Petal.Width' then assigning NULL (deleting it)."

In [5]:
head(iris)

  Length Width Species
1 5.1    3.5   setosa
2 4.9    3.0   setosa
3 4.7    3.2   setosa
4 4.6    3.1   setosa
5 5.0    3.6   setosa
6 5.4    3.9   setosa

### Understanding automatic indexing
You've been introduced to the rule that "if i is a single variable name, it is evaluated in the calling scope, otherwise inside DT's scope". This is a very important rule if you want to conceptually understand what is going on when using column names in i. Only single columns on the left side of operators benefit from automatic indexing.

The iris data.table with the variable names you updated in the previous exercise is available in your workspace.

INSTRUCTIONS
100 XP
 - Select the rows where the area is greater than 20 square centimeters.
 - Add a new boolean column containing Width * Length > 25 and call it is_large. Remember that := can be used to create new columns.
 - Select the rows for which the value of is_large is TRUE.

In [7]:
# Cleaned up iris data.table
iris

# Area is greater than 20 square centimeters
iris[Width*Length > 20]

# Add new boolean column
iris[,is_large := Width*Length>25]

# Now large observations with is_large
iris[is_large==TRUE]

   Length Width Species    is_large
1  5.4    3.9   setosa     FALSE
2  5.8    4.0   setosa     FALSE
3  5.7    4.4   setosa      TRUE
4  5.4    3.9   setosa     FALSE
5  5.7    3.8   setosa     FALSE
6  5.2    4.1   setosa     FALSE
7  5.5    4.2   setosa     FALSE
8  7.0    3.2   versicolor FALSE
9  6.4    3.2   versicolor FALSE
10 6.9    3.1   versicolor FALSE
11 6.3    3.3   versicolor FALSE
12 6.7    3.1   versicolor FALSE
13 6.7    3.0   versicolor FALSE
14 6.0    3.4   versicolor FALSE
15 6.7    3.1   versicolor FALSE
16 6.3    3.3   virginica  FALSE
17 7.1    3.0   virginica  FALSE
18 7.6    3.0   virginica  FALSE
19 7.3    2.9   virginica  FALSE
20 7.2    3.6   virginica   TRUE
21 6.5    3.2   virginica  FALSE
22 6.8    3.0   virginica  FALSE
23 6.4    3.2   virginica  FALSE
24 7.7    3.8   virginica   TRUE
25 7.7    2.6   virginica  FALSE
26 6.9    3.2   virginica  FALSE
27 7.7    2.8   virginica  FALSE
28 6.7    3.3   virginica  FALSE
29 7.2    3.2   virginica  FALSE
30 7.2    3.0   virginica  FALSE
31 7.4    2.8   virginica  FALSE
32 7.9    3.8   virginica   TRUE
33 7.7    3.0   virginica  FALSE
34 6.3    3.4   virginica  FALSE
35 6.9    3.1   virginica  FALSE
36 6.7    3.1   virginica  FALSE
37 6.9    3.1   virginica  FALSE
38 6.8    3.2   virginica  FALSE
39 6.7    3.3   virginica  FALSE
40 6.7    3.0   virginica  FALSE
41 6.2    3.4   virginica  FALSE

  Length Width Species   is_large
1 5.7    4.4   setosa    TRUE
2 7.2    3.6   virginica TRUE
3 7.7    3.8   virginica TRUE
4 7.9    3.8   virginica TRUE

## Section 9 - Keys  - Video

In [16]:
DT = data.table(A = c("b", "a", "b", "c", "a", "b", "c"), 
                B = c(2, 4, 1, 7, 5, 3, 6), 
                C = 6:12)
DT

  A B C
1 b 2  6
2 a 4  7
3 b 1  8
4 c 7  9
5 a 5 10
6 b 3 11
7 c 6 12

### Check to see if you understood the KEY takeaways
The DT data.table is already loaded in your workspace. Perform the following operations:

 - Select the b group using ==.
 - Set a 2-column key on A and B.
 - Select the b group again using ==.
 
Did the order of the rows within the b group change?

INSTRUCTIONS
50 XP
 - Possible Answers
 - Click or Press Ctrl+1 to focus
 - Yes
 - No

In [17]:
DT[A=="b"]

  A B C
1 b 2  6
2 b 1  8
3 b 3 11

In [18]:
setkey(DT, A,B)

In [19]:
DT[A=="b"]

  A B C
1 b 1  8
2 b 2  6
3 b 3 11

Correct. This is because B is included in the key.

### Selecting groups or parts of groups
The previous exercise illustrated how you can manually set a key via setkey(DT, A, B). setkey() sorts the data by the columns that you specify and changes the table by reference. Having set a key will allow you to use it, for example, as a super-charged row name when doing selections. Arguments like mult and nomatch then help you to select only particular parts of groups.

Furthermore, two of the instructions will require you to make use of by = .EACHI. This allows you to run j for each group in which each item in i joins too. The last instruction will require you to produce a side effect inside the j argument in addition to selecting rows.

INSTRUCTIONS
100 XP

A data.table DT has already been created for you with the keys set to A and B.

 - Select the "b" group without using ==.
 - Select the "b" and "c" groups, again without using ==.
 - Select the first row of the "b" and "c" groups using mult.
 - Use by = .EACHI and .SD to select the first and last row of the "b" and "c" groups.
 - Extend the previous command to print out the group before returning the first and last row from it. You can use curly brackets to include two separate instructions inside the j argument.

In [20]:
# The 'keyed' data.table DT
DT <- data.table(A = letters[c(2, 1, 2, 3, 1, 2, 3)], 
                 B = c(5, 4, 1, 9, 8, 8, 6), 
                 C = 6:12)
setkey(DT, A, B)

# Select the "b" group
DT["b"]

# "b" and "c" groups
DT[c("b", "c")]

# The first row of the "b" and "c" groups
DT[c("b", "c"), mult = "first"]

# First and last row of the "b" and "c" groups
DT[c("b", "c"), .SD[c(1, .N)], by = .EACHI]

# Copy and extend code for instruction 4: add printout
DT[c("b", "c"), { print(.SD); .SD[c(1, .N)] }, by = .EACHI]

  A B C
1 b 1  8
2 b 5  6
3 b 8 11

  A B C
1 b 1  8
2 b 5  6
3 b 8 11
4 c 6 12
5 c 9  9

  A B C
1 b 1  8
2 c 6 12

  A B C
1 b 1  8
2 b 8 11
3 c 6 12
4 c 9  9

   B  C
1: 1  8
2: 5  6
3: 8 11
   B  C
1: 6 12
2: 9  9

  A B C
1 b 1  8
2 b 8 11
3 c 6 12
4 c 9  9

### HINT
Do not forget that you can use standard R functions in i. More specifically, you'll be needing c() everywhere except for the first instruction.

## Section 10 - Rolling joins - Video

### Rolling joins - part one
In the last video, you learned about rolling joins. The roll applies to the NA values in the last join column. In the next three exercises, you will learn how to work with rolling joins in a data.table setting.

INSTRUCTIONS
100 XP
The same keyed data.table from before, DT, has been provided in the sample code.

 - Get the key of DT through the key() function.
 - Use the super-charged row names to look up the row where A == "b" and B == 6, without using ==! Verify here that column C is NA.
 - Based on the query that was written in the previous instruction, return the prevailing row before this "gap". Specify the roll argument.
 - Again, start with the code from the second instruction, but this time, find the nearest row. Specify the roll argument accordingly.

In [21]:
# Keyed data.table DT
DT <- data.table(A = letters[c(2, 1, 2, 3, 1, 2, 3)], 
                 B = c(5, 4, 1, 9, 8, 8, 6), 
                 C = 6:12, 
                 key = "A,B")

# Get the key of DT
key(DT)

# Row where A == "b" and B == 6
DT[.("b",6)]

# Return the prevailing row
DT[.("b",6), roll=TRUE]

# Return the nearest row
DT[,.("b",6), roll="nearest"]

[1] "A" "B"

  A B C
1 b 6 NA

  A B C
1 b 6 6

  V1 V2
1 b  6

### Rolling joins - part two
It is time to move on to the rollends argument. The rollends argument is actually a vector of two logical values, but remember that you can always look this up via ?data.table. You were introduced to this argument via the control ends section. If you want to roll for a certain distance, you should continue to use the roll argument.

INSTRUCTIONS
100 XP

 - For the group where column A is equal to "b", print out the sequence when column B is set equal to (-2):10. Remember, A and B are the keys for this data.table.
 - Extend the code you wrote for the first instruction to roll the prevailing values forward to replace the NAs.
 - Extend your code with the appropriate rollends value to roll the first observation backwards.

In [22]:
# Keyed data.table DT
DT <- data.table(A = letters[c(2, 1, 2, 3, 1, 2, 3)], 
                 B = c(5, 4, 1, 9, 8, 8, 6), 
                 C = 6:12, 
                 key = "A,B")

# Get the key of DT
key(DT)

# Row where A == "b" and B == 6
DT[.("b",6)]

# Return the prevailing row
DT[.("b",6), roll=TRUE]

# Return the nearest row
DT[,.("b",6), roll="nearest"]

[1] "A" "B"

  A B C
1 b 6 NA

  A B C
1 b 6 6

  V1 V2
1 b  6

### Rolling joins - part two
It is time to move on to the rollends argument. The rollends argument is actually a vector of two logical values, but remember that you can always look this up via ?data.table. You were introduced to this argument via the control ends section. If you want to roll for a certain distance, you should continue to use the roll argument.

INSTRUCTIONS
100 XP

 - For the group where column A is equal to "b", print out the sequence when column B is set equal to (-2):10. Remember, A and B are the keys for this data.table.
 - Extend the code you wrote for the first instruction to roll the prevailing values forward to replace the NAs.
 - Extend your code with the appropriate rollends value to roll the first observation backwards.

In [23]:
# Keyed data.table DT
DT <- data.table(A = letters[c(2, 1, 2, 3, 1, 2, 3)], 
                 B = c(5, 4, 1, 9, 8, 8, 6), 
                 C = 6:12, 
                 key = "A,B")

# Print the sequence (-2):10 for the "b" group
DT[.("b", (-2):10)]

# Add code: carry the prevailing values forwards
DT[.("b", (-2):10), roll = +Inf]

# Add code: carry the first observation backwards
DT[.("b", (-2):10), roll = +Inf, rollends=TRUE]

   A B  C
1  b -2 NA
2  b -1 NA
3  b  0 NA
4  b  1  8
5  b  2 NA
6  b  3 NA
7  b  4 NA
8  b  5  6
9  b  6 NA
10 b  7 NA
11 b  8 11
12 b  9 NA
13 b 10 NA

   A B  C
1  b -2 NA
2  b -1 NA
3  b  0 NA
4  b  1  8
5  b  2  8
6  b  3  8
7  b  4  8
8  b  5  6
9  b  6  6
10 b  7  6
11 b  8 11
12 b  9 11
13 b 10 11

   A B  C
1  b -2  8
2  b -1  8
3  b  0  8
4  b  1  8
5  b  2  8
6  b  3  8
7  b  4  8
8  b  5  6
9  b  6  6
10 b  7  6
11 b  8 11
12 b  9 11
13 b 10 11

### Rolling joins - final part

DT is loaded in your workspace. If you look up the value B == 20 in group A == "b" without limiting the roll, the value of column C is...

INSTRUCTIONS
50 XP

Possible Answers
Click or Press Ctrl+1 to focus
 - NA
 - 11 (Correct)
 - 8
 - 6

In [24]:
DT = data.table(A = c("a", "a", "b", "b", "b", "c", "c"), B = c(4, 
8, 1, 5, 8, 6, 9), C = c(7L, 10L, 8L, 6L, 11L, 12L, 9L))

In [25]:
DT

  A B C
1 a 4  7
2 a 8 10
3 b 1  8
4 b 5  6
5 b 8 11
6 c 6 12
7 c 9  9

## Thank You